Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA308.h
extern volatile LCDDATA3BITS LCDDATA3bits __attribute__((__sfr__));

#define LCDDATA4 LCDDATA4
extern volatile unsigned int  LCDDATA4 __attribute__((__sfr__));
typedef struct tagLCDDATA4BITS {
  unsigned S00C1:1;
  unsigned S01C1:1;
  unsigned S02C1:1;
  unsigned S03C1:1;
  unsigned S04C1:1;
  unsigned S05C1:1;
  unsigned S06C1:1;
  unsigned S07C1:1;
  unsigned S08C1:1;
  unsigned S09C1:1;
  unsigned S10C1:1;
  unsigned S11C1:1;
  unsigned S12C1:1;
  unsigned S13C1:1;
  unsigned S14C1:1;
  unsigned S15C1:1;
} LCDDATA4BITS;
extern volatile LCDDATA4BITS LCDDATA4bits __attribute__((__sfr__));

#define LCDDATA5 LCDDATA5
extern volatile unsigned int  LCDDATA5 __attribute__((__sfr__));
typedef struct tagLCDDATA5BITS {
  unsigned S16C1:1;
  unsigned S17C1:1;
  unsigned S18C1:1;
  unsigned S19C1:1;
  unsigned S20C1:1;
  unsigned S21C1:1;
  unsigned S22C1:1;
  unsigned S23C1:1;
  unsigned S24C1:1;
  unsigned S25C1:1;
  unsigned S26C1:1;
  unsigned S27C1:1;
  unsigned S28C1:1;
  unsigned S29C1:1;
  unsigned S30C1:1;
  unsigned S31C1:1;
} LCDDATA5BITS;
extern volatile LCDDATA5BITS LCDDATA5bits __attribute__((__sfr__));

#define LCDDATA6 LCDDATA6
extern volatile unsigned int  LCDDATA6 __attribute__((__sfr__));
typedef struct tagLCDDATA6BITS {
  unsigned S32C1:1;
  unsigned S33C1:1;
  unsigned S34C1:1;
  unsigned S35C1:1;
  unsigned S36C1:1;
  unsigned S37C1:1;
  unsigned S38C1:1;
  unsigned S39C1:1;
  unsigned S40C1:1;
  unsigned S41C1:1;
  unsigned S42C1:1;
  unsigned S43C1:1;
  unsigned S44C1:1;
  unsigned S45C1:1;
  unsigned S46C1:1;
  unsigned S47C1:1;
} LCDDATA6BITS;
extern volatile LCDDATA6BITS LCDDATA6bits __attribute__((__sfr__));

#define LCDDATA7 LCDDATA7
extern volatile unsigned int  LCDDATA7 __attribute__((__sfr__));
typedef struct tagLCDDATA7BITS {
  unsigned S48C1:1;
  unsigned :1;
  unsigned S50C1:1;
} LCDDATA7BITS;
extern volatile LCDDATA7BITS LCDDATA7bits __attribute__((__sfr__));

#define LCDDATA8 LCDDATA8
extern volatile unsigned int  LCDDATA8 __attribute__((__sfr__));
typedef struct tagLCDDATA8BITS {
  unsigned S00C2:1;
  unsigned S01C2:1;
  unsigned S02C2:1;
  unsigned S03C2:1;
  unsigned S04C2:1;
  unsigned S05C2:1;
  unsigned S06C2:1;
  unsigned S07C2:1;
  unsigned S08C2:1;
  unsigned S09C2:1;
  unsigned S10C2:1;
  unsigned S11C2:1;
  unsigned S12C2:1;
  unsigned S13C2:1;
  unsigned S14C2:1;
  unsigned S15C2:1;
} LCDDATA8BITS;
extern volatile LCDDATA8BITS LCDDATA8bits __attribute__((__sfr__));

#define LCDDATA9 LCDDATA9
extern volatile unsigned int  LCDDATA9 __attribute__((__sfr__));
typedef struct tagLCDDATA9BITS {
  unsigned S16C2:1;
  unsigned S17C2:1;
  unsigned S18C2:1;
  unsigned S19C2:1;
  unsigned S20C2:1;
  unsigned S21C2:1;
  unsigned S22C2:1;
  unsigned S23C2:1;
  unsigned S24C2:1;
  unsigned S25C2:1;
  unsigned S26C2:1;
  unsigned S27C2:1;
  unsigned S28C2:1;
  unsigned S29C2:1;
  unsigned S30C2:1;
  unsigned S31C2:1;
} LCDDATA9BITS;
extern volatile LCDDATA9BITS LCDDATA9bits __attribute__((__sfr__));

#define LCDDATA10 LCDDATA10
extern volatile unsigned int  LCDDATA10 __attribute__((__sfr__));
typedef struct tagLCDDATA10BITS {
  unsigned S32C2:1;
  unsigned S33C2:1;
  unsigned S34C2:1;
  unsigned S35C2:1;
  unsigned S36C2:1;
  unsigned S37C2:1;
  unsigned S38C2:1;
  unsigned S39C2:1;
  unsigned S40C2:1;
  unsigned S41C2:1;
  unsigned S42C2:1;
  unsigned S43C2:1;
  unsigned S44C2:1;
  unsigned S45C2:1;
  unsigned S46C2:1;
  unsigned S47C2:1;
} LCDDATA10BITS;
extern volatile LCDDATA10BITS LCDDATA10bits __attribute__((__sfr__));

#define LCDDATA11 LCDDATA11
extern volatile unsigned int  LCDDATA11 __attribute__((__sfr__));
typedef struct tagLCDDATA11BITS {
  unsigned S48C2:1;
  unsigned :1;
  unsigned S50C2:1;
} LCDDATA11BITS;
extern volatile LCDDATA11BITS LCDDATA11bits __attribute__((__sfr__));

#define LCDDATA12 LCDDATA12
extern volatile unsigned int  LCDDATA12 __attribute__((__sfr__));
typedef struct tagLCDDATA12BITS {
  unsigned S00C3:1;
  unsigned S01C3:1;
  unsigned S02C3:1;
  unsigned S03C3:1;
  unsigned S04C3:1;
  unsigned S05C3:1;
  unsigned S06C3:1;
  unsigned S07C3:1;
  unsigned S08C3:1;
  unsigned S09C3:1;
  unsigned S10C3:1;
  unsigned S11C3:1;
  unsigned S12C3:1;
  unsigned S13C3:1;
  unsigned S14C3:1;
  unsigned S15C3:1;
} LCDDATA12BITS;
extern volatile LCDDATA12BITS LCDDATA12bits __attribute__((__sfr__));

#define LCDDATA13 LCDDATA13
extern volatile unsigned int  LCDDATA13 __attribute__((__sfr__));
typedef struct tagLCDDATA13BITS {
  unsigned S16C3:1;
  unsigned S17C3:1;
  unsigned S18C3:1;
  unsigned S19C3:1;
  unsigned S20C3:1;
  unsigned S21C3:1;
  unsigned S22C3:1;
  unsigned S23C3:1;
  unsigned S24C3:1;
  unsigned S25C3:1;
  unsigned S26C3:1;
  unsigned S27C3:1;
  unsigned S28C3:1;
  unsigned S29C3:1;
  unsigned S30C3:1;
  unsigned S31C3:1;
} LCDDATA13BITS;
extern volatile LCDDATA13BITS LCDDATA13bits __attribute__((__sfr__));

#define LCDDATA14 LCDDATA14
extern volatile unsigned int  LCDDATA14 __attribute__((__sfr__));
typedef struct tagLCDDATA14BITS {
  unsigned S32C3:1;
  unsigned S33C3:1;
  unsigned S34C3:1;
  unsigned S35C3:1;
  unsigned S36C3:1;
  unsigned S37C3:1;
  unsigned S38C3:1;
  unsigned S39C3:1;
  unsigned S40C3:1;
  unsigned S41C3:1;
  unsigned S42C3:1;
  unsigned S43C3:1;
  unsigned S44C3:1;
  unsigned S45C3:1;
  unsigned S46C3:1;
  unsigned S47C3:1;
} LCDDATA14BITS;
extern volatile LCDDATA14BITS LCDDATA14bits __attribute__((__sfr__));

#define LCDDATA15 LCDDATA15
extern volatile unsigned int  LCDDATA15 __attribute__((__sfr__));
typedef struct tagLCDDATA15BITS {
  unsigned S48C3:1;
  unsigned :1;
  unsigned S50C3:1;
} LCDDATA15BITS;
extern volatile LCDDATA15BITS LCDDATA15bits __attribute__((__sfr__));

#define LCDDATA16 LCDDATA16
extern volatile unsigned int  LCDDATA16 __attribute__((__sfr__));
typedef struct tagLCDDATA16BITS {
  unsigned S00C4:1;
  unsigned S01C4:1;
  unsigned S02C4:1;
  unsigned S03C4:1;
  unsigned S04C4:1;
  unsigned S05C4:1;
  unsigned S06C4:1;
  unsigned S07C4:1;
  unsigned S08C4:1;
  unsigned S09C4:1;
  unsigned S10C4:1;
  unsigned S11C4:1;
  unsigned S12C4:1;
  unsigned S13C4:1;
  unsigned S14C4:1;
  unsigned S15C4:1;
} LCDDATA16BITS;
