Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA308.h
#define _LCDREF_LRLAT0_POSITION                  0x00000000
#define _LCDREF_LRLAT0_MASK                      0x00000001
#define _LCDREF_LRLAT0_LENGTH                    0x00000001

#define _LCDREF_LRLAT1_POSITION                  0x00000001
#define _LCDREF_LRLAT1_MASK                      0x00000002
#define _LCDREF_LRLAT1_LENGTH                    0x00000001

#define _LCDREF_LRLAT2_POSITION                  0x00000002
#define _LCDREF_LRLAT2_MASK                      0x00000004
#define _LCDREF_LRLAT2_LENGTH                    0x00000001

#define _LCDREF_LRLBP0_POSITION                  0x00000004
#define _LCDREF_LRLBP0_MASK                      0x00000010
#define _LCDREF_LRLBP0_LENGTH                    0x00000001

#define _LCDREF_LRLBP1_POSITION                  0x00000005
#define _LCDREF_LRLBP1_MASK                      0x00000020
#define _LCDREF_LRLBP1_LENGTH                    0x00000001

#define _LCDREF_LRLAP0_POSITION                  0x00000006
#define _LCDREF_LRLAP0_MASK                      0x00000040
#define _LCDREF_LRLAP0_LENGTH                    0x00000001

#define _LCDREF_LRLAP1_POSITION                  0x00000007
#define _LCDREF_LRLAP1_MASK                      0x00000080
#define _LCDREF_LRLAP1_LENGTH                    0x00000001

#define _LCDREF_LCDCST0_POSITION                 0x0000000B
#define _LCDREF_LCDCST0_MASK                     0x00000800
#define _LCDREF_LCDCST0_LENGTH                   0x00000001

#define _LCDREF_LCDCST1_POSITION                 0x0000000C
#define _LCDREF_LCDCST1_MASK                     0x00001000
#define _LCDREF_LCDCST1_LENGTH                   0x00000001

#define _LCDREF_LCDCST2_POSITION                 0x0000000D
#define _LCDREF_LCDCST2_MASK                     0x00002000
#define _LCDREF_LCDCST2_LENGTH                   0x00000001

#define _LCDCON_LMUX_POSITION                    0x00000000
#define _LCDCON_LMUX_MASK                        0x00000007
#define _LCDCON_LMUX_LENGTH                      0x00000003

#define _LCDCON_CS_POSITION                      0x00000003
#define _LCDCON_CS_MASK                          0x00000018
#define _LCDCON_CS_LENGTH                        0x00000002

#define _LCDCON_WERR_POSITION                    0x00000005
#define _LCDCON_WERR_MASK                        0x00000020
#define _LCDCON_WERR_LENGTH                      0x00000001

#define _LCDCON_SLPEN_POSITION                   0x00000006
#define _LCDCON_SLPEN_MASK                       0x00000040
#define _LCDCON_SLPEN_LENGTH                     0x00000001

#define _LCDCON_LCDSIDL_POSITION                 0x0000000D
#define _LCDCON_LCDSIDL_MASK                     0x00002000
#define _LCDCON_LCDSIDL_LENGTH                   0x00000001

#define _LCDCON_LCDEN_POSITION                   0x0000000F
#define _LCDCON_LCDEN_MASK                       0x00008000
#define _LCDCON_LCDEN_LENGTH                     0x00000001

#define _LCDCON_LMUX0_POSITION                   0x00000000
#define _LCDCON_LMUX0_MASK                       0x00000001
#define _LCDCON_LMUX0_LENGTH                     0x00000001

#define _LCDCON_LMUX1_POSITION                   0x00000001
#define _LCDCON_LMUX1_MASK                       0x00000002
#define _LCDCON_LMUX1_LENGTH                     0x00000001

#define _LCDCON_LMUX2_POSITION                   0x00000002
#define _LCDCON_LMUX2_MASK                       0x00000004
#define _LCDCON_LMUX2_LENGTH                     0x00000001

#define _LCDCON_CS0_POSITION                     0x00000003
#define _LCDCON_CS0_MASK                         0x00000008
#define _LCDCON_CS0_LENGTH                       0x00000001

#define _LCDCON_CS1_POSITION                     0x00000004
#define _LCDCON_CS1_MASK                         0x00000010
#define _LCDCON_CS1_LENGTH                       0x00000001

#define _LCDPS_LP_POSITION                       0x00000000
#define _LCDPS_LP_MASK                           0x0000000F
#define _LCDPS_LP_LENGTH                         0x00000004

#define _LCDPS_WA_POSITION                       0x00000004
#define _LCDPS_WA_MASK                           0x00000010
#define _LCDPS_WA_LENGTH                         0x00000001

#define _LCDPS_LCDA_POSITION                     0x00000005
#define _LCDPS_LCDA_MASK                         0x00000020
#define _LCDPS_LCDA_LENGTH                       0x00000001

#define _LCDPS_BIASMD_POSITION                   0x00000006
#define _LCDPS_BIASMD_MASK                       0x00000040
#define _LCDPS_BIASMD_LENGTH                     0x00000001

#define _LCDPS_WFT_POSITION                      0x00000007
#define _LCDPS_WFT_MASK                          0x00000080
#define _LCDPS_WFT_LENGTH                        0x00000001

#define _LCDPS_LP0_POSITION                      0x00000000
#define _LCDPS_LP0_MASK                          0x00000001
#define _LCDPS_LP0_LENGTH                        0x00000001

#define _LCDPS_LP1_POSITION                      0x00000001
#define _LCDPS_LP1_MASK                          0x00000002
#define _LCDPS_LP1_LENGTH                        0x00000001

#define _LCDPS_LP2_POSITION                      0x00000002
#define _LCDPS_LP2_MASK                          0x00000004
#define _LCDPS_LP2_LENGTH                        0x00000001

#define _LCDPS_LP3_POSITION                      0x00000003
#define _LCDPS_LP3_MASK                          0x00000008
#define _LCDPS_LP3_LENGTH                        0x00000001

#define _LCDSE0_SE00_POSITION                    0x00000000
#define _LCDSE0_SE00_MASK                        0x00000001
#define _LCDSE0_SE00_LENGTH                      0x00000001

#define _LCDSE0_SE01_POSITION                    0x00000001
#define _LCDSE0_SE01_MASK                        0x00000002
#define _LCDSE0_SE01_LENGTH                      0x00000001

#define _LCDSE0_SE02_POSITION                    0x00000002
#define _LCDSE0_SE02_MASK                        0x00000004
#define _LCDSE0_SE02_LENGTH                      0x00000001

#define _LCDSE0_SE03_POSITION                    0x00000003
#define _LCDSE0_SE03_MASK                        0x00000008
#define _LCDSE0_SE03_LENGTH                      0x00000001

#define _LCDSE0_SE04_POSITION                    0x00000004
#define _LCDSE0_SE04_MASK                        0x00000010
#define _LCDSE0_SE04_LENGTH                      0x00000001

