Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA308.h
#define _LCDDATA13_S29C3_POSITION                0x0000000D
#define _LCDDATA13_S29C3_MASK                    0x00002000
#define _LCDDATA13_S29C3_LENGTH                  0x00000001

#define _LCDDATA13_S30C3_POSITION                0x0000000E
#define _LCDDATA13_S30C3_MASK                    0x00004000
#define _LCDDATA13_S30C3_LENGTH                  0x00000001

#define _LCDDATA13_S31C3_POSITION                0x0000000F
#define _LCDDATA13_S31C3_MASK                    0x00008000
#define _LCDDATA13_S31C3_LENGTH                  0x00000001

#define _LCDDATA14_S32C3_POSITION                0x00000000
#define _LCDDATA14_S32C3_MASK                    0x00000001
#define _LCDDATA14_S32C3_LENGTH                  0x00000001

#define _LCDDATA14_S33C3_POSITION                0x00000001
#define _LCDDATA14_S33C3_MASK                    0x00000002
#define _LCDDATA14_S33C3_LENGTH                  0x00000001

#define _LCDDATA14_S34C3_POSITION                0x00000002
#define _LCDDATA14_S34C3_MASK                    0x00000004
#define _LCDDATA14_S34C3_LENGTH                  0x00000001

#define _LCDDATA14_S35C3_POSITION                0x00000003
#define _LCDDATA14_S35C3_MASK                    0x00000008
#define _LCDDATA14_S35C3_LENGTH                  0x00000001

#define _LCDDATA14_S36C3_POSITION                0x00000004
#define _LCDDATA14_S36C3_MASK                    0x00000010
#define _LCDDATA14_S36C3_LENGTH                  0x00000001

#define _LCDDATA14_S37C3_POSITION                0x00000005
#define _LCDDATA14_S37C3_MASK                    0x00000020
#define _LCDDATA14_S37C3_LENGTH                  0x00000001

#define _LCDDATA14_S38C3_POSITION                0x00000006
#define _LCDDATA14_S38C3_MASK                    0x00000040
#define _LCDDATA14_S38C3_LENGTH                  0x00000001

#define _LCDDATA14_S39C3_POSITION                0x00000007
#define _LCDDATA14_S39C3_MASK                    0x00000080
#define _LCDDATA14_S39C3_LENGTH                  0x00000001

#define _LCDDATA14_S40C3_POSITION                0x00000008
#define _LCDDATA14_S40C3_MASK                    0x00000100
#define _LCDDATA14_S40C3_LENGTH                  0x00000001

#define _LCDDATA14_S41C3_POSITION                0x00000009
#define _LCDDATA14_S41C3_MASK                    0x00000200
#define _LCDDATA14_S41C3_LENGTH                  0x00000001

#define _LCDDATA14_S42C3_POSITION                0x0000000A
#define _LCDDATA14_S42C3_MASK                    0x00000400
#define _LCDDATA14_S42C3_LENGTH                  0x00000001

#define _LCDDATA14_S43C3_POSITION                0x0000000B
#define _LCDDATA14_S43C3_MASK                    0x00000800
#define _LCDDATA14_S43C3_LENGTH                  0x00000001

#define _LCDDATA14_S44C3_POSITION                0x0000000C
#define _LCDDATA14_S44C3_MASK                    0x00001000
#define _LCDDATA14_S44C3_LENGTH                  0x00000001

#define _LCDDATA14_S45C3_POSITION                0x0000000D
#define _LCDDATA14_S45C3_MASK                    0x00002000
#define _LCDDATA14_S45C3_LENGTH                  0x00000001

#define _LCDDATA14_S46C3_POSITION                0x0000000E
#define _LCDDATA14_S46C3_MASK                    0x00004000
#define _LCDDATA14_S46C3_LENGTH                  0x00000001

#define _LCDDATA14_S47C3_POSITION                0x0000000F
#define _LCDDATA14_S47C3_MASK                    0x00008000
#define _LCDDATA14_S47C3_LENGTH                  0x00000001

#define _LCDDATA15_S48C3_POSITION                0x00000000
#define _LCDDATA15_S48C3_MASK                    0x00000001
#define _LCDDATA15_S48C3_LENGTH                  0x00000001

#define _LCDDATA15_S50C3_POSITION                0x00000002
#define _LCDDATA15_S50C3_MASK                    0x00000004
#define _LCDDATA15_S50C3_LENGTH                  0x00000001

#define _LCDDATA16_S00C4_POSITION                0x00000000
#define _LCDDATA16_S00C4_MASK                    0x00000001
#define _LCDDATA16_S00C4_LENGTH                  0x00000001

#define _LCDDATA16_S01C4_POSITION                0x00000001
#define _LCDDATA16_S01C4_MASK                    0x00000002
#define _LCDDATA16_S01C4_LENGTH                  0x00000001

#define _LCDDATA16_S02C4_POSITION                0x00000002
#define _LCDDATA16_S02C4_MASK                    0x00000004
#define _LCDDATA16_S02C4_LENGTH                  0x00000001

#define _LCDDATA16_S03C4_POSITION                0x00000003
#define _LCDDATA16_S03C4_MASK                    0x00000008
#define _LCDDATA16_S03C4_LENGTH                  0x00000001

#define _LCDDATA16_S04C4_POSITION                0x00000004
#define _LCDDATA16_S04C4_MASK                    0x00000010
#define _LCDDATA16_S04C4_LENGTH                  0x00000001

#define _LCDDATA16_S05C4_POSITION                0x00000005
#define _LCDDATA16_S05C4_MASK                    0x00000020
#define _LCDDATA16_S05C4_LENGTH                  0x00000001

#define _LCDDATA16_S06C4_POSITION                0x00000006
#define _LCDDATA16_S06C4_MASK                    0x00000040
#define _LCDDATA16_S06C4_LENGTH                  0x00000001

#define _LCDDATA16_S07C4_POSITION                0x00000007
#define _LCDDATA16_S07C4_MASK                    0x00000080
#define _LCDDATA16_S07C4_LENGTH                  0x00000001

#define _LCDDATA16_S08C4_POSITION                0x00000008
#define _LCDDATA16_S08C4_MASK                    0x00000100
#define _LCDDATA16_S08C4_LENGTH                  0x00000001

#define _LCDDATA16_S09C4_POSITION                0x00000009
#define _LCDDATA16_S09C4_MASK                    0x00000200
#define _LCDDATA16_S09C4_LENGTH                  0x00000001

#define _LCDDATA16_S10C4_POSITION                0x0000000A
#define _LCDDATA16_S10C4_MASK                    0x00000400
#define _LCDDATA16_S10C4_LENGTH                  0x00000001

#define _LCDDATA16_S11C4_POSITION                0x0000000B
#define _LCDDATA16_S11C4_MASK                    0x00000800
#define _LCDDATA16_S11C4_LENGTH                  0x00000001

#define _LCDDATA16_S12C4_POSITION                0x0000000C
#define _LCDDATA16_S12C4_MASK                    0x00001000
#define _LCDDATA16_S12C4_LENGTH                  0x00000001

