Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA308.h
#define _LCDDATA25_S22C6_POSITION                0x00000006
#define _LCDDATA25_S22C6_MASK                    0x00000040
#define _LCDDATA25_S22C6_LENGTH                  0x00000001

#define _LCDDATA25_S23C6_POSITION                0x00000007
#define _LCDDATA25_S23C6_MASK                    0x00000080
#define _LCDDATA25_S23C6_LENGTH                  0x00000001

#define _LCDDATA25_S24C6_POSITION                0x00000008
#define _LCDDATA25_S24C6_MASK                    0x00000100
#define _LCDDATA25_S24C6_LENGTH                  0x00000001

#define _LCDDATA25_S25C6_POSITION                0x00000009
#define _LCDDATA25_S25C6_MASK                    0x00000200
#define _LCDDATA25_S25C6_LENGTH                  0x00000001

#define _LCDDATA25_S26C6_POSITION                0x0000000A
#define _LCDDATA25_S26C6_MASK                    0x00000400
#define _LCDDATA25_S26C6_LENGTH                  0x00000001

#define _LCDDATA25_S27C6_POSITION                0x0000000B
#define _LCDDATA25_S27C6_MASK                    0x00000800
#define _LCDDATA25_S27C6_LENGTH                  0x00000001

#define _LCDDATA25_S28C6_POSITION                0x0000000C
#define _LCDDATA25_S28C6_MASK                    0x00001000
#define _LCDDATA25_S28C6_LENGTH                  0x00000001

#define _LCDDATA25_S29C6_POSITION                0x0000000D
#define _LCDDATA25_S29C6_MASK                    0x00002000
#define _LCDDATA25_S29C6_LENGTH                  0x00000001

#define _LCDDATA25_S30C6_POSITION                0x0000000E
#define _LCDDATA25_S30C6_MASK                    0x00004000
#define _LCDDATA25_S30C6_LENGTH                  0x00000001

#define _LCDDATA25_S31C6_POSITION                0x0000000F
#define _LCDDATA25_S31C6_MASK                    0x00008000
#define _LCDDATA25_S31C6_LENGTH                  0x00000001

#define _LCDDATA26_S32C6_POSITION                0x00000000
#define _LCDDATA26_S32C6_MASK                    0x00000001
#define _LCDDATA26_S32C6_LENGTH                  0x00000001

#define _LCDDATA26_S33C6_POSITION                0x00000001
#define _LCDDATA26_S33C6_MASK                    0x00000002
#define _LCDDATA26_S33C6_LENGTH                  0x00000001

#define _LCDDATA26_S34C6_POSITION                0x00000002
#define _LCDDATA26_S34C6_MASK                    0x00000004
#define _LCDDATA26_S34C6_LENGTH                  0x00000001

#define _LCDDATA26_S35C6_POSITION                0x00000003
#define _LCDDATA26_S35C6_MASK                    0x00000008
#define _LCDDATA26_S35C6_LENGTH                  0x00000001

#define _LCDDATA26_S36C6_POSITION                0x00000004
#define _LCDDATA26_S36C6_MASK                    0x00000010
#define _LCDDATA26_S36C6_LENGTH                  0x00000001

#define _LCDDATA26_S37C6_POSITION                0x00000005
#define _LCDDATA26_S37C6_MASK                    0x00000020
#define _LCDDATA26_S37C6_LENGTH                  0x00000001

#define _LCDDATA26_S38C6_POSITION                0x00000006
#define _LCDDATA26_S38C6_MASK                    0x00000040
#define _LCDDATA26_S38C6_LENGTH                  0x00000001

#define _LCDDATA26_S39C6_POSITION                0x00000007
#define _LCDDATA26_S39C6_MASK                    0x00000080
#define _LCDDATA26_S39C6_LENGTH                  0x00000001

#define _LCDDATA26_S40C6_POSITION                0x00000008
#define _LCDDATA26_S40C6_MASK                    0x00000100
#define _LCDDATA26_S40C6_LENGTH                  0x00000001

#define _LCDDATA26_S41C6_POSITION                0x00000009
#define _LCDDATA26_S41C6_MASK                    0x00000200
#define _LCDDATA26_S41C6_LENGTH                  0x00000001

#define _LCDDATA26_S42C6_POSITION                0x0000000A
#define _LCDDATA26_S42C6_MASK                    0x00000400
#define _LCDDATA26_S42C6_LENGTH                  0x00000001

#define _LCDDATA26_S43C6_POSITION                0x0000000B
#define _LCDDATA26_S43C6_MASK                    0x00000800
#define _LCDDATA26_S43C6_LENGTH                  0x00000001

#define _LCDDATA26_S44C6_POSITION                0x0000000C
#define _LCDDATA26_S44C6_MASK                    0x00001000
#define _LCDDATA26_S44C6_LENGTH                  0x00000001

#define _LCDDATA26_S45C6_POSITION                0x0000000D
#define _LCDDATA26_S45C6_MASK                    0x00002000
#define _LCDDATA26_S45C6_LENGTH                  0x00000001

#define _LCDDATA26_S46C6_POSITION                0x0000000E
#define _LCDDATA26_S46C6_MASK                    0x00004000
#define _LCDDATA26_S46C6_LENGTH                  0x00000001

#define _LCDDATA26_S47C6_POSITION                0x0000000F
#define _LCDDATA26_S47C6_MASK                    0x00008000
#define _LCDDATA26_S47C6_LENGTH                  0x00000001

#define _LCDDATA27_S48C6_POSITION                0x00000000
#define _LCDDATA27_S48C6_MASK                    0x00000001
#define _LCDDATA27_S48C6_LENGTH                  0x00000001

#define _LCDDATA27_S50C6_POSITION                0x00000002
#define _LCDDATA27_S50C6_MASK                    0x00000004
#define _LCDDATA27_S50C6_LENGTH                  0x00000001

#define _LCDDATA28_S00C7_POSITION                0x00000000
#define _LCDDATA28_S00C7_MASK                    0x00000001
#define _LCDDATA28_S00C7_LENGTH                  0x00000001

#define _LCDDATA28_S01C7_POSITION                0x00000001
#define _LCDDATA28_S01C7_MASK                    0x00000002
#define _LCDDATA28_S01C7_LENGTH                  0x00000001

#define _LCDDATA28_S02C7_POSITION                0x00000002
#define _LCDDATA28_S02C7_MASK                    0x00000004
#define _LCDDATA28_S02C7_LENGTH                  0x00000001

#define _LCDDATA28_S03C7_POSITION                0x00000003
#define _LCDDATA28_S03C7_MASK                    0x00000008
#define _LCDDATA28_S03C7_LENGTH                  0x00000001

#define _LCDDATA28_S04C7_POSITION                0x00000004
#define _LCDDATA28_S04C7_MASK                    0x00000010
#define _LCDDATA28_S04C7_LENGTH                  0x00000001

#define _LCDDATA28_S05C7_POSITION                0x00000005
#define _LCDDATA28_S05C7_MASK                    0x00000020
#define _LCDDATA28_S05C7_LENGTH                  0x00000001

#define _LCDDATA28_S06C7_POSITION                0x00000006
#define _LCDDATA28_S06C7_MASK                    0x00000040
#define _LCDDATA28_S06C7_LENGTH                  0x00000001

#define _LCDDATA28_S07C7_POSITION                0x00000007
#define _LCDDATA28_S07C7_MASK                    0x00000080
#define _LCDDATA28_S07C7_LENGTH                  0x00000001

#define _LCDDATA28_S08C7_POSITION                0x00000008
#define _LCDDATA28_S08C7_MASK                    0x00000100
#define _LCDDATA28_S08C7_LENGTH                  0x00000001

#define _LCDDATA28_S09C7_POSITION                0x00000009
#define _LCDDATA28_S09C7_MASK                    0x00000200
#define _LCDDATA28_S09C7_LENGTH                  0x00000001

#define _LCDDATA28_S10C7_POSITION                0x0000000A
#define _LCDDATA28_S10C7_MASK                    0x00000400
#define _LCDDATA28_S10C7_LENGTH                  0x00000001

#define _LCDDATA28_S11C7_POSITION                0x0000000B
#define _LCDDATA28_S11C7_MASK                    0x00000800
#define _LCDDATA28_S11C7_LENGTH                  0x00000001

#define _LCDDATA28_S12C7_POSITION                0x0000000C
#define _LCDDATA28_S12C7_MASK                    0x00001000
#define _LCDDATA28_S12C7_LENGTH                  0x00000001

#define _LCDDATA28_S13C7_POSITION                0x0000000D
#define _LCDDATA28_S13C7_MASK                    0x00002000
#define _LCDDATA28_S13C7_LENGTH                  0x00000001

