Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA308.h
#define _RTCPWC_PWCPRE_POSITION                  0x0000000D
#define _RTCPWC_PWCPRE_MASK                      0x00002000
#define _RTCPWC_PWCPRE_LENGTH                    0x00000001

#define _RTCPWC_PWCPOL_POSITION                  0x0000000E
#define _RTCPWC_PWCPOL_MASK                      0x00004000
#define _RTCPWC_PWCPOL_LENGTH                    0x00000001

#define _RTCPWC_PWCEN_POSITION                   0x0000000F
#define _RTCPWC_PWCEN_MASK                       0x00008000
#define _RTCPWC_PWCEN_LENGTH                     0x00000001

#define _RTCPWC_RTCOUT0_POSITION                 0x00000008
#define _RTCPWC_RTCOUT0_MASK                     0x00000100
#define _RTCPWC_RTCOUT0_LENGTH                   0x00000001

#define _RTCPWC_RTCOUT1_POSITION                 0x00000009
#define _RTCPWC_RTCOUT1_MASK                     0x00000200
#define _RTCPWC_RTCOUT1_LENGTH                   0x00000001

#define _RTCPWC_RTCLK0_POSITION                  0x0000000A
#define _RTCPWC_RTCLK0_MASK                      0x00000400
#define _RTCPWC_RTCLK0_LENGTH                    0x00000001

#define _RTCPWC_RTCLK1_POSITION                  0x0000000B
#define _RTCPWC_RTCLK1_MASK                      0x00000800
#define _RTCPWC_RTCLK1_LENGTH                    0x00000001

#define _MDCON_MDBIT_POSITION                    0x00000000
#define _MDCON_MDBIT_MASK                        0x00000001
#define _MDCON_MDBIT_LENGTH                      0x00000001

#define _MDCON_MDOPOL_POSITION                   0x00000004
#define _MDCON_MDOPOL_MASK                       0x00000010
#define _MDCON_MDOPOL_LENGTH                     0x00000001

#define _MDCON_MDSLR_POSITION                    0x00000005
#define _MDCON_MDSLR_MASK                        0x00000020
#define _MDCON_MDSLR_LENGTH                      0x00000001

#define _MDCON_MDOE_POSITION                     0x00000006
#define _MDCON_MDOE_MASK                         0x00000040
#define _MDCON_MDOE_LENGTH                       0x00000001

#define _MDCON_MDSIDL_POSITION                   0x0000000D
#define _MDCON_MDSIDL_MASK                       0x00002000
#define _MDCON_MDSIDL_LENGTH                     0x00000001

#define _MDCON_MDEN_POSITION                     0x0000000F
#define _MDCON_MDEN_MASK                         0x00008000
#define _MDCON_MDEN_LENGTH                       0x00000001

#define _MDSRC_MS_POSITION                       0x00000000
#define _MDSRC_MS_MASK                           0x0000000F
#define _MDSRC_MS_LENGTH                         0x00000004

#define _MDSRC_SODIS_POSITION                    0x00000007
#define _MDSRC_SODIS_MASK                        0x00000080
#define _MDSRC_SODIS_LENGTH                      0x00000001

#define _MDSRC_MS0_POSITION                      0x00000000
#define _MDSRC_MS0_MASK                          0x00000001
#define _MDSRC_MS0_LENGTH                        0x00000001

#define _MDSRC_MS1_POSITION                      0x00000001
#define _MDSRC_MS1_MASK                          0x00000002
#define _MDSRC_MS1_LENGTH                        0x00000001

#define _MDSRC_MS2_POSITION                      0x00000002
#define _MDSRC_MS2_MASK                          0x00000004
#define _MDSRC_MS2_LENGTH                        0x00000001

#define _MDSRC_MS3_POSITION                      0x00000003
#define _MDSRC_MS3_MASK                          0x00000008
#define _MDSRC_MS3_LENGTH                        0x00000001

#define _MDCAR_CL_POSITION                       0x00000000
#define _MDCAR_CL_MASK                           0x0000000F
#define _MDCAR_CL_LENGTH                         0x00000004

#define _MDCAR_CLSYNC_POSITION                   0x00000005
#define _MDCAR_CLSYNC_MASK                       0x00000020
#define _MDCAR_CLSYNC_LENGTH                     0x00000001

#define _MDCAR_CLPOL_POSITION                    0x00000006
#define _MDCAR_CLPOL_MASK                        0x00000040
#define _MDCAR_CLPOL_LENGTH                      0x00000001

#define _MDCAR_CLODIS_POSITION                   0x00000007
#define _MDCAR_CLODIS_MASK                       0x00000080
#define _MDCAR_CLODIS_LENGTH                     0x00000001

#define _MDCAR_CH_POSITION                       0x00000008
#define _MDCAR_CH_MASK                           0x00000F00
#define _MDCAR_CH_LENGTH                         0x00000004

#define _MDCAR_CHSYNC_POSITION                   0x0000000D
#define _MDCAR_CHSYNC_MASK                       0x00002000
#define _MDCAR_CHSYNC_LENGTH                     0x00000001

#define _MDCAR_CHPOL_POSITION                    0x0000000E
#define _MDCAR_CHPOL_MASK                        0x00004000
#define _MDCAR_CHPOL_LENGTH                      0x00000001

#define _MDCAR_CHODIS_POSITION                   0x0000000F
#define _MDCAR_CHODIS_MASK                       0x00008000
#define _MDCAR_CHODIS_LENGTH                     0x00000001

#define _MDCAR_CL0_POSITION                      0x00000000
#define _MDCAR_CL0_MASK                          0x00000001
#define _MDCAR_CL0_LENGTH                        0x00000001

#define _MDCAR_CL1_POSITION                      0x00000001
#define _MDCAR_CL1_MASK                          0x00000002
#define _MDCAR_CL1_LENGTH                        0x00000001

#define _MDCAR_CL2_POSITION                      0x00000002
#define _MDCAR_CL2_MASK                          0x00000004
#define _MDCAR_CL2_LENGTH                        0x00000001

#define _MDCAR_CL3_POSITION                      0x00000003
#define _MDCAR_CL3_MASK                          0x00000008
#define _MDCAR_CL3_LENGTH                        0x00000001

#define _MDCAR_CH0_POSITION                      0x00000008
#define _MDCAR_CH0_MASK                          0x00000100
#define _MDCAR_CH0_LENGTH                        0x00000001

#define _MDCAR_CH1_POSITION                      0x00000009
#define _MDCAR_CH1_MASK                          0x00000200
#define _MDCAR_CH1_LENGTH                        0x00000001

#define _MDCAR_CH2_POSITION                      0x0000000A
#define _MDCAR_CH2_MASK                          0x00000400
#define _MDCAR_CH2_LENGTH                        0x00000001

